# Задача 1. Поработайте с переменными, создайте несколько, выведите на экран.

a = 123
b = 123.456
print('a =', a, 'type:', type(a))
print('b =', b, 'type:', type(b))

welcome_words = 'Добро пожаловать в систему!'
print(welcome_words)

# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

name = input("Ваше имя: ")
age = int(input("Ваш возраст: "))
city = input("Ваш город: ")

print('Добро пожаловать', name, ', возраст', age, ', из города', city, '!')
